package basic.loop;

import java.util.Scanner;

// 반복문 (while문)
public class WhileExample2 {

	public static void main(String[] args) {
		 
/////////////////////////////////////////////////////////////////////////		
//		 48 ~ 150 사이의 정수 중 8의 배수로만 가로로 출력해 보세요.
		int e = 48;
		
//		while(i <= 150) {
//			if(i % 8 == 0) {
//				System.out.print(i + " ");
//			}
//			i++;
//		}
		while(e <= 150) {
			System.out.print(e + " ");
			e += 8;
		}
/////////////////////////////////////////////////////////////////////////		
//		1 ~ 100까지의 정수 중 4의 배수이면서
//		8의 배수는 아닌 수를 가로로 출력해 보세요.
		
		int f = 1;
		
		while(f <=  100) {
			if(f % 4 == 0 && f % 8 != 0) {
				System.out.print(f + " ");
			}
			f++;
		}
			System.out.println(" ");
/////////////////////////////////////////////////////////////////////////		
//		1 ~ 30000 까지의 정수 중 258의 배수의 개수를 출력.
			
		int b = 1; //258의 배수를 구할사람(반복문 돌릴 애)
		int b2 = 0; //258의 배수의 개수를 구할 집
		
		while(b <= 30000) { //b가 3만보다 적을때 if로 간다
			if (b % 258 == 0) { //b의 숫자가 258로 나눴을때 나머지가 0이 되었을때 
								//b는 258의 배수 if문이 false면 바로 b++로
								//if문이 true 일때 b2 += 1; 식으로 이동
				b2 = b2 + 1; //258의 배수 b가 나타날때마다 1이 추가
				//1+1+1+1+1+.....+1 (b2 = b2 + 1)
			}
			b++; //b가 30000에 같아질때까지 진행
		}
			System.out.print("258의 배수의 개수 : "+ b2);
			System.out.println(" ");
		
//////////////////////////////////////////////////////////////////////////
//		1000의 약수의 개수를 구하세요.
//		1부터 1000까지 하나씩 올려가면서 1000이랑 나눠보세요.
//		그랬을 때 나누어 떨어지는 애가 약수입니다.
		
		int c = 1;
		
		int c2 = 0;
		
		while(1000>= c) {
			if (1000 % c == 0) {
				c2 += 1;
			}
			c++;
		}
			System.out.print("1000의 약수의 개수 :" + c2);
			System.out.println(" ");
			
/////////////////////////////////////////////////////////////////////////		
		
		int d = 1;
		int d2= 0;
		
		while(d <= 300) {
			if(300 % d == 0 && 250 % d == 0) {
				d2 += 1;
			}
			d++;
		}
			System.out.println(d2);
			System.out.println("------------------------------------");
			
/////////////////////////////////////////////////////////////////////////		
		
		Scanner sc = new Scanner(System.in);
		
		int s = (int) ((Math.random()*9) + 1);
			System.out.println("랜덤숫자 : " + s);
		int s2 = 1;
		String st = "*";
		
		while(s2 <= 9) {
			
			int s3 = s2 * s;
			System.out.printf("%d %s %d = %d\n", s, st, s2, s3);
			
			s2++;
		}
		
/////////////////////////////////////////////////////////////////////////	
	
	}
	
	
	
}
				
